#ifndef S1AP_PROTOCOL_IES_READER_H
#define S1AP_PROTOCOL_IES_READER_H

/* Generated by flatcc 0.6.0-pre FlatBuffers schema compiler for C by dvide.com */

#ifndef FLATBUFFERS_COMMON_READER_H
#include "flatbuffers_common_reader.h"
#endif
#include "flatcc_flatbuffers.h"
#ifndef __alignas_is_defined
#include <stdalign.h>
#endif
#include "flatcc_prologue.h"
#ifndef flatbuffers_identifier
#define flatbuffers_identifier 0
#endif
#ifndef flatbuffers_extension
#define flatbuffers_extension ".bin"
#endif

typedef struct LteS1_ProtocolIE_UE_S1AP_ID_pair LteS1_ProtocolIE_UE_S1AP_ID_pair_t;
typedef const LteS1_ProtocolIE_UE_S1AP_ID_pair_t *LteS1_ProtocolIE_UE_S1AP_ID_pair_struct_t;
typedef LteS1_ProtocolIE_UE_S1AP_ID_pair_t *LteS1_ProtocolIE_UE_S1AP_ID_pair_mutable_struct_t;
typedef const LteS1_ProtocolIE_UE_S1AP_ID_pair_t *LteS1_ProtocolIE_UE_S1AP_ID_pair_vec_t;
typedef LteS1_ProtocolIE_UE_S1AP_ID_pair_t *LteS1_ProtocolIE_UE_S1AP_ID_pair_mutable_vec_t;
typedef struct LteS1_ProtocolIE_COUNTvalue LteS1_ProtocolIE_COUNTvalue_t;
typedef const LteS1_ProtocolIE_COUNTvalue_t *LteS1_ProtocolIE_COUNTvalue_struct_t;
typedef LteS1_ProtocolIE_COUNTvalue_t *LteS1_ProtocolIE_COUNTvalue_mutable_struct_t;
typedef const LteS1_ProtocolIE_COUNTvalue_t *LteS1_ProtocolIE_COUNTvalue_vec_t;
typedef LteS1_ProtocolIE_COUNTvalue_t *LteS1_ProtocolIE_COUNTvalue_mutable_vec_t;
typedef struct LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item_t;

static inline int LteS1_ProtocolIE_Pre_emptionVulnerability_is_known_value(LteS1_ProtocolIE_Pre_emptionVulnerability_enum_t value)
{
    switch (value) {
    case LteS1_ProtocolIE_Pre_emptionVulnerability_not_pre_emptable: return 1;
    case LteS1_ProtocolIE_Pre_emptionVulnerability_pre_emptable: return 1;
    default: return 0;
    }
}

typedef int8_t LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t;
__flatbuffers_define_integer_type(LteS1_ProtocolIE_RRC_Establishment_Cause_enum, LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t, 8)
#define LteS1_ProtocolIE_RRC_Establishment_Cause_enum_emergency ((LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t)INT8_C(0))
#define LteS1_ProtocolIE_RRC_Establishment_Cause_enum_highPriorityAccess ((LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t)INT8_C(1))
#define LteS1_ProtocolIE_RRC_Establishment_Cause_enum_mt_Access ((LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t)INT8_C(2))
#define LteS1_ProtocolIE_RRC_Establishment_Cause_enum_mo_Signalling ((LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t)INT8_C(3))
#define LteS1_ProtocolIE_RRC_Establishment_Cause_enum_mo_Data ((LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t)INT8_C(4))
#define LteS1_ProtocolIE_RRC_Establishment_Cause_enum_delay_TolerantAccess ((LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t)INT8_C(5))
#define LteS1_ProtocolIE_RRC_Establishment_Cause_enum_mo_VoiceCall ((LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t)INT8_C(6))

static inline const char *LteS1_ProtocolIE_RRC_Establishment_Cause_enum_name(LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t value)
{
    switch (value) {
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_emergency: return "emergency";
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_highPriorityAccess: return "highPriorityAccess";
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_mt_Access: return "mt_Access";
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_mo_Signalling: return "mo_Signalling";
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_mo_Data: return "mo_Data";
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_delay_TolerantAccess: return "delay_TolerantAccess";
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_mo_VoiceCall: return "mo_VoiceCall";
    default: return "";
    }
}

static inline int LteS1_ProtocolIE_RRC_Establishment_Cause_enum_is_known_value(LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t value)
{
    switch (value) {
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_emergency: return 1;
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_highPriorityAccess: return 1;
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_mt_Access: return 1;
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_mo_Signalling: return 1;
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_mo_Data: return 1;
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_delay_TolerantAccess: return 1;
    case LteS1_ProtocolIE_RRC_Establishment_Cause_enum_mo_VoiceCall: return 1;
    default: return 0;
    }
}


struct LteS1_ProtocolIE_UE_S1AP_ID_pair {
    alignas(4) uint32_t MME_UE_S1AP_ID;
    alignas(4) uint32_t ENB_UE_S1AP_ID;
};
static_assert(sizeof(LteS1_ProtocolIE_UE_S1AP_ID_pair_t) == 8, "struct size mismatch");

static inline const LteS1_ProtocolIE_UE_S1AP_ID_pair_t *LteS1_ProtocolIE_UE_S1AP_ID_pair__const_ptr_add(const LteS1_ProtocolIE_UE_S1AP_ID_pair_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_UE_S1AP_ID_pair_t *LteS1_ProtocolIE_UE_S1AP_ID_pair__ptr_add(LteS1_ProtocolIE_UE_S1AP_ID_pair_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_UE_S1AP_ID_pair_struct_t LteS1_ProtocolIE_UE_S1AP_ID_pair_vec_at(LteS1_ProtocolIE_UE_S1AP_ID_pair_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_UE_S1AP_ID_pair__size() { return 8; }
static inline size_t LteS1_ProtocolIE_UE_S1AP_ID_pair_vec_len(LteS1_ProtocolIE_UE_S1AP_ID_pair_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_UE_S1AP_ID_pair)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_UE_S1AP_ID_pair, MME_UE_S1AP_ID, flatbuffers_uint32, uint32_t)
__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_UE_S1AP_ID_pair, ENB_UE_S1AP_ID, flatbuffers_uint32, uint32_t)

struct LteS1_ProtocolIE_COUNTvalue {
    alignas(4) uint8_t pDCP_SN;
    alignas(4) uint32_t hFN;
};
static_assert(sizeof(LteS1_ProtocolIE_COUNTvalue_t) == 8, "struct size mismatch");

static inline const LteS1_ProtocolIE_COUNTvalue_t *LteS1_ProtocolIE_COUNTvalue__const_ptr_add(const LteS1_ProtocolIE_COUNTvalue_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_COUNTvalue_t *LteS1_ProtocolIE_COUNTvalue__ptr_add(LteS1_ProtocolIE_COUNTvalue_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_COUNTvalue_struct_t LteS1_ProtocolIE_COUNTvalue_vec_at(LteS1_ProtocolIE_COUNTvalue_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_COUNTvalue__size() { return 8; }
static inline size_t LteS1_ProtocolIE_COUNTvalue_vec_len(LteS1_ProtocolIE_COUNTvalue_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_COUNTvalue)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_COUNTvalue, pDCP_SN, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_COUNTvalue, hFN, flatbuffers_uint32, uint32_t)

struct LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item {
    alignas(4) uint32_t e_RAB_ID;
    alignas(4) LteS1_ProtocolIE_COUNTvalue_t uL_COUNTvalue;
    alignas(4) LteS1_ProtocolIE_COUNTvalue_t dL_COUNTvalue;
};
static_assert(sizeof(LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item_t) == 20, "struct size mismatch");

static inline const LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item_t *LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item__const_ptr_add(const LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item_t *LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item__ptr_add(LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item_struct_t LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item_vec_at(LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item__size() { return 20; }
static inline size_t LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item_vec_len(LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item, e_RAB_ID, flatbuffers_uint32, uint32_t)
__flatbuffers_define_struct_struct_field(LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item, uL_COUNTvalue, LteS1_ProtocolIE_COUNTvalue_struct_t)
__flatbuffers_define_struct_struct_field(LteS1_ProtocolIE_Bearers_SubjectToStatusTransfer_Item, dL_COUNTvalue, LteS1_ProtocolIE_COUNTvalue_struct_t)

struct LteS1_ProtocolIE_CauseMisc {
    alignas(1) LteS1_ProtocolIE_CauseMisc_enum_enum_t CauseMisc_value;
};
static_assert(sizeof(LteS1_ProtocolIE_CauseMisc_t) == 1, "struct size mismatch");

static inline const LteS1_ProtocolIE_CauseMisc_t *LteS1_ProtocolIE_CauseMisc__const_ptr_add(const LteS1_ProtocolIE_CauseMisc_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_CauseMisc_t *LteS1_ProtocolIE_CauseMisc__ptr_add(LteS1_ProtocolIE_CauseMisc_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_CauseMisc_struct_t LteS1_ProtocolIE_CauseMisc_vec_at(LteS1_ProtocolIE_CauseMisc_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_CauseMisc__size() { return 1; }
static inline size_t LteS1_ProtocolIE_CauseMisc_vec_len(LteS1_ProtocolIE_CauseMisc_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_CauseMisc)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_CauseMisc, CauseMisc_value, LteS1_ProtocolIE_CauseMisc_enum, LteS1_ProtocolIE_CauseMisc_enum_enum_t)

struct LteS1_ProtocolIE_CauseProtocol {
    alignas(1) LteS1_ProtocolIE_CauseProtocol_enum_enum_t CauseProtocol_value;
};
static_assert(sizeof(LteS1_ProtocolIE_CauseProtocol_t) == 1, "struct size mismatch");

static inline const LteS1_ProtocolIE_CauseProtocol_t *LteS1_ProtocolIE_CauseProtocol__const_ptr_add(const LteS1_ProtocolIE_CauseProtocol_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_CauseProtocol_t *LteS1_ProtocolIE_CauseProtocol__ptr_add(LteS1_ProtocolIE_CauseProtocol_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_CauseProtocol_struct_t LteS1_ProtocolIE_CauseProtocol_vec_at(LteS1_ProtocolIE_CauseProtocol_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_CauseProtocol__size() { return 1; }
static inline size_t LteS1_ProtocolIE_CauseProtocol_vec_len(LteS1_ProtocolIE_CauseProtocol_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_CauseProtocol)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_CauseProtocol, CauseProtocol_value, LteS1_ProtocolIE_CauseProtocol_enum, LteS1_ProtocolIE_CauseProtocol_enum_enum_t)

struct LteS1_ProtocolIE_CauseNas {
    alignas(1) LteS1_ProtocolIE_CauseNas_enum_enum_t CauseNas_value;
};
static_assert(sizeof(LteS1_ProtocolIE_CauseNas_t) == 1, "struct size mismatch");

static inline const LteS1_ProtocolIE_CauseNas_t *LteS1_ProtocolIE_CauseNas__const_ptr_add(const LteS1_ProtocolIE_CauseNas_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_CauseNas_t *LteS1_ProtocolIE_CauseNas__ptr_add(LteS1_ProtocolIE_CauseNas_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_CauseNas_struct_t LteS1_ProtocolIE_CauseNas_vec_at(LteS1_ProtocolIE_CauseNas_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_CauseNas__size() { return 1; }
static inline size_t LteS1_ProtocolIE_CauseNas_vec_len(LteS1_ProtocolIE_CauseNas_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_CauseNas)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_CauseNas, CauseNas_value, LteS1_ProtocolIE_CauseNas_enum, LteS1_ProtocolIE_CauseNas_enum_enum_t)

struct LteS1_ProtocolIE_CauseTransport {
    alignas(1) LteS1_ProtocolIE_CauseTransport_enum_enum_t CauseTransport_value;
};
static_assert(sizeof(LteS1_ProtocolIE_CauseTransport_t) == 1, "struct size mismatch");

static inline const LteS1_ProtocolIE_CauseTransport_t *LteS1_ProtocolIE_CauseTransport__const_ptr_add(const LteS1_ProtocolIE_CauseTransport_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_CauseTransport_t *LteS1_ProtocolIE_CauseTransport__ptr_add(LteS1_ProtocolIE_CauseTransport_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_CauseTransport_struct_t LteS1_ProtocolIE_CauseTransport_vec_at(LteS1_ProtocolIE_CauseTransport_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_CauseTransport__size() { return 1; }
static inline size_t LteS1_ProtocolIE_CauseTransport_vec_len(LteS1_ProtocolIE_CauseTransport_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_CauseTransport)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_CauseTransport, CauseTransport_value, LteS1_ProtocolIE_CauseTransport_enum, LteS1_ProtocolIE_CauseTransport_enum_enum_t)

struct LteS1_ProtocolIE_CauseRadioNetwork {
    alignas(1) LteS1_ProtocolIE_CauseRadioNetwork_enum_enum_t CauseRadioNetwork_value;
};
static_assert(sizeof(LteS1_ProtocolIE_CauseRadioNetwork_t) == 1, "struct size mismatch");

static inline const LteS1_ProtocolIE_CauseRadioNetwork_t *LteS1_ProtocolIE_CauseRadioNetwork__const_ptr_add(const LteS1_ProtocolIE_CauseRadioNetwork_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_CauseRadioNetwork_t *LteS1_ProtocolIE_CauseRadioNetwork__ptr_add(LteS1_ProtocolIE_CauseRadioNetwork_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_CauseRadioNetwork_struct_t LteS1_ProtocolIE_CauseRadioNetwork_vec_at(LteS1_ProtocolIE_CauseRadioNetwork_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_CauseRadioNetwork__size() { return 1; }
static inline size_t LteS1_ProtocolIE_CauseRadioNetwork_vec_len(LteS1_ProtocolIE_CauseRadioNetwork_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_CauseRadioNetwork)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_CauseRadioNetwork, CauseRadioNetwork_value, LteS1_ProtocolIE_CauseRadioNetwork_enum, LteS1_ProtocolIE_CauseRadioNetwork_enum_enum_t)

struct LteS1_ProtocolIE_HandoverType {
    alignas(1) LteS1_ProtocolIE_HandoverType_enum_enum_t HandoverType_value;
};
static_assert(sizeof(LteS1_ProtocolIE_HandoverType_t) == 1, "struct size mismatch");

static inline const LteS1_ProtocolIE_HandoverType_t *LteS1_ProtocolIE_HandoverType__const_ptr_add(const LteS1_ProtocolIE_HandoverType_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_HandoverType_t *LteS1_ProtocolIE_HandoverType__ptr_add(LteS1_ProtocolIE_HandoverType_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_HandoverType_struct_t LteS1_ProtocolIE_HandoverType_vec_at(LteS1_ProtocolIE_HandoverType_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_HandoverType__size() { return 1; }
static inline size_t LteS1_ProtocolIE_HandoverType_vec_len(LteS1_ProtocolIE_HandoverType_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_HandoverType)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_HandoverType, HandoverType_value, LteS1_ProtocolIE_HandoverType_enum, LteS1_ProtocolIE_HandoverType_enum_enum_t)

struct LteS1_ProtocolIE_AllocationAndRetentionPriority {
    alignas(1) uint8_t priorityLevel;
    alignas(1) LteS1_ProtocolIE_Pre_emptionCapability_enum_t pre_emptionCapability;
    alignas(1) LteS1_ProtocolIE_Pre_emptionVulnerability_enum_t pre_emptionVulnerability;
};
static_assert(sizeof(LteS1_ProtocolIE_AllocationAndRetentionPriority_t) == 3, "struct size mismatch");

static inline const LteS1_ProtocolIE_AllocationAndRetentionPriority_t *LteS1_ProtocolIE_AllocationAndRetentionPriority__const_ptr_add(const LteS1_ProtocolIE_AllocationAndRetentionPriority_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_AllocationAndRetentionPriority_t *LteS1_ProtocolIE_AllocationAndRetentionPriority__ptr_add(LteS1_ProtocolIE_AllocationAndRetentionPriority_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_AllocationAndRetentionPriority_struct_t LteS1_ProtocolIE_AllocationAndRetentionPriority_vec_at(LteS1_ProtocolIE_AllocationAndRetentionPriority_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_AllocationAndRetentionPriority__size() { return 3; }
static inline size_t LteS1_ProtocolIE_AllocationAndRetentionPriority_vec_len(LteS1_ProtocolIE_AllocationAndRetentionPriority_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_AllocationAndRetentionPriority)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_AllocationAndRetentionPriority, priorityLevel, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_AllocationAndRetentionPriority, pre_emptionCapability, LteS1_ProtocolIE_Pre_emptionCapability, LteS1_ProtocolIE_Pre_emptionCapability_enum_t)
__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_AllocationAndRetentionPriority, pre_emptionVulnerability, LteS1_ProtocolIE_Pre_emptionVulnerability, LteS1_ProtocolIE_Pre_emptionVulnerability_enum_t)

struct LteS1_ProtocolIE_E_RABLevelQoSParameters {
    alignas(1) uint8_t qCI;
    alignas(1) LteS1_ProtocolIE_AllocationAndRetentionPriority_t allocationRetentionPriority;
};
static_assert(sizeof(LteS1_ProtocolIE_E_RABLevelQoSParameters_t) == 4, "struct size mismatch");

static inline const LteS1_ProtocolIE_E_RABLevelQoSParameters_t *LteS1_ProtocolIE_E_RABLevelQoSParameters__const_ptr_add(const LteS1_ProtocolIE_E_RABLevelQoSParameters_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_E_RABLevelQoSParameters_t *LteS1_ProtocolIE_E_RABLevelQoSParameters__ptr_add(LteS1_ProtocolIE_E_RABLevelQoSParameters_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_E_RABLevelQoSParameters_struct_t LteS1_ProtocolIE_E_RABLevelQoSParameters_vec_at(LteS1_ProtocolIE_E_RABLevelQoSParameters_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_E_RABLevelQoSParameters__size() { return 4; }
static inline size_t LteS1_ProtocolIE_E_RABLevelQoSParameters_vec_len(LteS1_ProtocolIE_E_RABLevelQoSParameters_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_E_RABLevelQoSParameters)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_E_RABLevelQoSParameters, qCI, flatbuffers_uint8, uint8_t)
__flatbuffers_define_struct_struct_field(LteS1_ProtocolIE_E_RABLevelQoSParameters, allocationRetentionPriority, LteS1_ProtocolIE_AllocationAndRetentionPriority_struct_t)

struct LteS1_ProtocolIE_UEAggregateMaximumBitrate {
    alignas(8) uint64_t uEaggregateMaximumBitRateDL;
    alignas(8) uint64_t uEaggregateMaximumBitRateUL;
};
static_assert(sizeof(LteS1_ProtocolIE_UEAggregateMaximumBitrate_t) == 16, "struct size mismatch");

static inline const LteS1_ProtocolIE_UEAggregateMaximumBitrate_t *LteS1_ProtocolIE_UEAggregateMaximumBitrate__const_ptr_add(const LteS1_ProtocolIE_UEAggregateMaximumBitrate_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_UEAggregateMaximumBitrate_t *LteS1_ProtocolIE_UEAggregateMaximumBitrate__ptr_add(LteS1_ProtocolIE_UEAggregateMaximumBitrate_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_UEAggregateMaximumBitrate_struct_t LteS1_ProtocolIE_UEAggregateMaximumBitrate_vec_at(LteS1_ProtocolIE_UEAggregateMaximumBitrate_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_UEAggregateMaximumBitrate__size() { return 16; }
static inline size_t LteS1_ProtocolIE_UEAggregateMaximumBitrate_vec_len(LteS1_ProtocolIE_UEAggregateMaximumBitrate_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_UEAggregateMaximumBitrate)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_UEAggregateMaximumBitrate, uEaggregateMaximumBitRateDL, flatbuffers_uint64, uint64_t)
__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_UEAggregateMaximumBitrate, uEaggregateMaximumBitRateUL, flatbuffers_uint64, uint64_t)

struct LteS1_ProtocolIE_RRC_Establishment_Cause {
    alignas(1) LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t RRC_Establishment_Cause_value;
};
static_assert(sizeof(LteS1_ProtocolIE_RRC_Establishment_Cause_t) == 1, "struct size mismatch");

static inline const LteS1_ProtocolIE_RRC_Establishment_Cause_t *LteS1_ProtocolIE_RRC_Establishment_Cause__const_ptr_add(const LteS1_ProtocolIE_RRC_Establishment_Cause_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_RRC_Establishment_Cause_t *LteS1_ProtocolIE_RRC_Establishment_Cause__ptr_add(LteS1_ProtocolIE_RRC_Establishment_Cause_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_RRC_Establishment_Cause_struct_t LteS1_ProtocolIE_RRC_Establishment_Cause_vec_at(LteS1_ProtocolIE_RRC_Establishment_Cause_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_RRC_Establishment_Cause__size() { return 1; }
static inline size_t LteS1_ProtocolIE_RRC_Establishment_Cause_vec_len(LteS1_ProtocolIE_RRC_Establishment_Cause_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_RRC_Establishment_Cause)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_RRC_Establishment_Cause, RRC_Establishment_Cause_value, LteS1_ProtocolIE_RRC_Establishment_Cause_enum, LteS1_ProtocolIE_RRC_Establishment_Cause_enum_enum_t)

struct LteS1_ProtocolIE_ENB_UE_S1AP_ID {
    alignas(4) uint32_t ENB_UE_S1AP_ID_value;
};
static_assert(sizeof(LteS1_ProtocolIE_ENB_UE_S1AP_ID_t) == 4, "struct size mismatch");

static inline const LteS1_ProtocolIE_ENB_UE_S1AP_ID_t *LteS1_ProtocolIE_ENB_UE_S1AP_ID__const_ptr_add(const LteS1_ProtocolIE_ENB_UE_S1AP_ID_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_ENB_UE_S1AP_ID_t *LteS1_ProtocolIE_ENB_UE_S1AP_ID__ptr_add(LteS1_ProtocolIE_ENB_UE_S1AP_ID_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_ENB_UE_S1AP_ID_struct_t LteS1_ProtocolIE_ENB_UE_S1AP_ID_vec_at(LteS1_ProtocolIE_ENB_UE_S1AP_ID_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_ENB_UE_S1AP_ID__size() { return 4; }
static inline size_t LteS1_ProtocolIE_ENB_UE_S1AP_ID_vec_len(LteS1_ProtocolIE_ENB_UE_S1AP_ID_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_ENB_UE_S1AP_ID)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_ENB_UE_S1AP_ID, ENB_UE_S1AP_ID_value, flatbuffers_uint32, uint32_t)

struct LteS1_ProtocolIE_MME_UE_S1AP_ID {
    alignas(4) uint32_t MME_UE_S1AP_ID_value;
};
static_assert(sizeof(LteS1_ProtocolIE_MME_UE_S1AP_ID_t) == 4, "struct size mismatch");

static inline const LteS1_ProtocolIE_MME_UE_S1AP_ID_t *LteS1_ProtocolIE_MME_UE_S1AP_ID__const_ptr_add(const LteS1_ProtocolIE_MME_UE_S1AP_ID_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_MME_UE_S1AP_ID_t *LteS1_ProtocolIE_MME_UE_S1AP_ID__ptr_add(LteS1_ProtocolIE_MME_UE_S1AP_ID_t *p, size_t i) { return p + i; }
static inline LteS1_ProtocolIE_MME_UE_S1AP_ID_struct_t LteS1_ProtocolIE_MME_UE_S1AP_ID_vec_at(LteS1_ProtocolIE_MME_UE_S1AP_ID_vec_t vec, size_t i)
__flatbuffers_struct_vec_at(vec, i)
static inline size_t LteS1_ProtocolIE_MME_UE_S1AP_ID__size() { return 4; }
static inline size_t LteS1_ProtocolIE_MME_UE_S1AP_ID_vec_len(LteS1_ProtocolIE_MME_UE_S1AP_ID_vec_t vec)
__flatbuffers_vec_len(vec)
__flatbuffers_struct_as_root(LteS1_ProtocolIE_MME_UE_S1AP_ID)

__flatbuffers_define_struct_scalar_field(LteS1_ProtocolIE_MME_UE_S1AP_ID, MME_UE_S1AP_ID_value, flatbuffers_uint32, uint32_t)

